Repository: hawezo/DiscordPresenceUI
Catalog: Properties/Resources.*.resx
Languages: fr_fr

source: App
fr_fr: Application

# app_details_text
source: Edit the form in order to update your Discord Presence. Click the update button and check your Discord. Refer to the [url=/Pages/Usage.xaml|_top]usage page[/url] for more informations about the configuration of your Discord Presence.
fr_fr: Modifiez le formulaire en entrant les informations que vous voulez afin de mettre à jour votre présence sur Discord. Référez-vous à la [url=/Pages/Usage.xaml|_top]page d'utilisation[/url] pour plus d'informations sur la configuration de votre présence Discord.

# app_details_title
source: APP DETAILS
fr_fr: PARAMÈTRES DE PRÉSENCE

source: App ID
fr_fr: Identifiant

source: App Settings
fr_fr: Paramètres

# app_settings_text
source: Edit the following settings according to your preferences. Click save to update them, reset if you want them to reset to default, or repair if they don't save when you tell them to.
fr_fr: Modifiez les paramètres suivants selon vos préférences. Appuyez sur Sauvegarder pour les enregistrer, sur Remettre à zéro pour obtenir les paramètres par défaut, ou sur Réparer s'ils ne s'enregistrent pas lorsque vous les sauvegardez.

# app_settings_title
source: APP SETTINGS
fr_fr: PARAMÈTRES

# boot_with_windows_text
source: Start with Windows
fr_fr: Démarrer avec Windows

# close_to_tray_text
source: Close to tray
fr_fr: Réduire en icône à la fermeture

source: Dark
fr_fr: Sombre

source: End Timestamp
fr_fr: Horodatage de fin

source: Exit
fr_fr: Quitter

source: Game Details
fr_fr: Détails

source: Game State
fr_fr: État

source: Help
fr_fr: Aide

# images_hint
source: You can add image in the [url=cmd://portal]developer portal[/url]. More informations [url=/Pages/Usage.xaml]here[/url].
fr_fr: Vous pouvez ajouter une image dans le [url=cmd://portal]portail[/url]. Plus d'informations [url=/Pages/Usage.xaml]ici[/url].

source: Large Image Key
fr_fr: Identifiant de l'image

source: Large Image Text
fr_fr: Texte de l'image

source: Light
fr_fr: Clair

source: Repair
fr_fr: Réparer

# repair_message
source: This will try to repair settings if they do not save after you close the app. Continue?
fr_fr: Si vous appuyez sur Oui, vos paramètres vont être effacés et une tentative de réparation va être effectuée. Continuer ?

source: Reset
fr_fr: Remettre à zéro

# restart_message
source: Do you want to restart?
fr_fr: Voulez-vous vraiment redémarrer l'application ?

source: Rich Presence
fr_fr: Présence

source: Save
fr_fr: Sauvegarder

source: Small Image Key
fr_fr: Identifiant de l'icône

source: Small Image Text
fr_fr: Texte de l'icône

# start_in_tray_text
source: Start in tray
fr_fr: Démarrer de manière réduite

source: Start Timestamp
fr_fr: Horodatage de fin

source: Update
fr_fr: Mettre à jour

source: Usage
fr_fr: Utilisation

source: CONFIGURE YOUR APP
fr_fr: CONFIGUREZ VOTRE APPLICATION

# configure_your_app_text
source: Now that your app is created, you need to [b]name[/b] it. You will be able to change its name whenever you want, but to do so you will need to head to the Developer Portal again. You will also need to copy your [b]client ID[/b], as it is needed in the [url=/Pages/RichPresenceSettings.xaml]settings page[/url]. The last thing you will need to do is to [url=cmd://portal]upload one or more assets[/url]. You can upload any image that has a minimum size of [b]512 x 512[/b]. You will also be required to name it so you can identify it in the settings page.
fr_fr: Maintenant que votre application est créée, vous devez lui [b]donner un nom[/b]. C'est ce nom qui apparaîtra comme jeu actuel dans la liste des membres de vos serveurs. Vous pouvez modifier ce nom quand vous voulez, mais seulement sur le portail des développeurs. Vous avez également besoin de copier votre [b]identifiant d'application[/b]. Il est requis dans les [url=/Pages/RichPresenceSettings.xaml]paramètres de présence[/url]. Enfin, vous devrez télécharger [url=cmd://portal]une ou plusieurs images[/url]. Vous pouvez envoyer n'importe quelle image de plus de [b]512 x 512[/b] pixels. Le nom que vous lui donnez sera celui que vous devrez renseigner dans les [url=/Pages/RichPresenceSettings.xaml]paramètres de présence[/url].

# create_your_app
source: CREATING YOUR APP
fr_fr: CRÉEZ VOTRE APPLICATION

# create_your_app_text
source: For the Discord Presence to work, you will need a few step that can not be done through this utility software. First of all, go to the [url=https://discordapp.com/developers/applications/]Developer Portal[/url]. You may have to log in before you can do anything. Once logged in, you will be able to [b]create an application[/b].
fr_fr: Pour que votre présence Discord fonctionne, vous aurez passer par quelques étapes qui ne peuvent s'effectuer que sur le site de Discord. Premièrement, rendez-vous sur ce [url=https://discordapp.com/developers/applications/]portail des développeurs[/url]. Vous aurez peut-être besoin de vous connecter. Une fois connecté, vous avez la possibilité de [b]créer une application[/b].

source: HOW TO USE
fr_fr: UTILISATION

# quick_note
source: QUICK NOTE ABOUT APPS
fr_fr: NOTE SUR LES APPLICATIONS

# quick_note_text
source: An app is a tool that allows a developer to create [b]bots[/b], [b]third party utilities[/b], or [b]rich presences[/b] for games. If you need more informations about the Developer Portal, you can check its [url=https://discordapp.com/developers/docs/intro]documentation[/url].
fr_fr: Une application est un outil qui permet à un développeur de créer des [b]bots[/b], des [b]logiciels tiers[/b], ou encore des [b]présences[/b] pour leurs jeux. Si vous avez besoin de plus d'informations sur le portail des développeurs, vous pouvez vous rendre sur sa [url=https://discordapp.com/developers/docs/intro]documentation[/url].

# exit_message
source: Are you sure you want to leave? Your Discord Presence will disappear if you do so.
fr_fr: Êtes-vous sûr de vouloir quitter ? Votre présence Discord va disparaître.

# reset_message
source: Reset settings? The app will restart if you click yes.
fr_fr: Ceci va remettre à zéro vos paramètres. Êtes-vous sûr de vouloir continuer ?

# locale_text
source: Language
fr_fr: Langage

source: Restart
fr_fr: Redémarrer

# new_version
source: A new version ({0}) is available. Current version is {1}. Do you want to download it?
fr_fr: Une nouvelle version ({0}) est disponible. La version actuelle est la {1}. Voulez-vous vous rendre sur la page de téléchargement ?

# new_version_text
source: New version ({0})
fr_fr: Nouvelle version ({0})
